In [15]:
from numpy.random import randn as rn
import numpy as np
import pandas as pd

C:\Users\JESAL\anaconda3\lib\importlib\_bootstrap.py:219: RuntimeWarning: numpy.ufunc size changed, may indicate binary incompatibility. Expected 192 from C header, got 216 from PyObject
  return f(*args, **kwds)

In [54]:
np.random.seed(1)
matrix=rn(5,5)
type(matrix),matrix
rows=[12,13,14,15,16]
columns=['X','Y','Z','W','P']
df=pd.DataFrame(matrix,rows,columns)
df

           X         Y         Z         W         P
12  1.624345 -0.611756 -0.528172 -1.072969  0.865408
13 -2.301539  1.744812 -0.761207  0.319039 -0.249370
14  1.462108 -2.060141 -0.322417 -0.384054  1.133769
15 -1.099891 -0.172428 -0.877858  0.042214  0.582815
16 -1.100619  1.144724  0.901591  0.502494  0.900856

In [44]:
#How to  extract data from dataframe

In [45]:
df[['X','Z']] #column wise extraction

          X         Z
A  1.624345 -0.528172
B -2.301539 -0.761207
C  1.462108 -0.322417
D -1.099891 -0.877858
E -1.100619  0.901591

In [46]:
df.loc['A'] #consider name indexes
#its fine if you have dublicate indexes

X    1.624345
Y   -0.611756
Z   -0.528172
W   -1.072969
P    0.865408
Name: A, dtype: float64

In [47]:
df.iloc[2]  #iloc consider  default indexes to extract the data
#system has never dublicate indexes

X    1.462108
Y   -2.060141
Z   -0.322417
W   -0.384054
P    1.133769
Name: C, dtype: float64

In [48]:
df

          X         Y         Z         W         P
A  1.624345 -0.611756 -0.528172 -1.072969  0.865408
B -2.301539  1.744812 -0.761207  0.319039 -0.249370
C  1.462108 -2.060141 -0.322417 -0.384054  1.133769
D -1.099891 -0.172428 -0.877858  0.042214  0.582815
E -1.100619  1.144724  0.901591  0.502494  0.900856

In [49]:
df.iloc[1:3,1:3]

          Y         Z
B  1.744812 -0.761207
C -2.060141 -0.322417

In [50]:
df.iloc[[1,2,3],[2,3]]

          Z         W
B -0.761207  0.319039
C -0.322417 -0.384054
D -0.877858  0.042214

In [55]:
df

           X         Y         Z         W         P
12  1.624345 -0.611756 -0.528172 -1.072969  0.865408
13 -2.301539  1.744812 -0.761207  0.319039 -0.249370
14  1.462108 -2.060141 -0.322417 -0.384054  1.133769
15 -1.099891 -0.172428 -0.877858  0.042214  0.582815
16 -1.100619  1.144724  0.901591  0.502494  0.900856

In [57]:
df.loc[13:16,'X':'W']

           X         Y         Z         W
13 -2.301539  1.744812 -0.761207  0.319039
14  1.462108 -2.060141 -0.322417 -0.384054
15 -1.099891 -0.172428 -0.877858  0.042214
16 -1.100619  1.144724  0.901591  0.502494

In [59]:
df['New']=df['Z'] +df['Y']
df['New(ZY)']=df['Z'] +df['Y']

In [60]:
df

           X         Y         Z         W         P       New   New(ZY)
12  1.624345 -0.611756 -0.528172 -1.072969  0.865408 -1.139928 -1.139928
13 -2.301539  1.744812 -0.761207  0.319039 -0.249370  0.983605  0.983605
14  1.462108 -2.060141 -0.322417 -0.384054  1.133769 -2.382558 -2.382558
15 -1.099891 -0.172428 -0.877858  0.042214  0.582815 -1.050287 -1.050287
16 -1.100619  1.144724  0.901591  0.502494  0.900856  2.046314  2.046314

In [61]:
df.drop('New(ZY)',axis=1,inplace=True)

In [70]:
df.drop(15)

           X         Y         Z         W         P       New
12  1.624345 -0.611756 -0.528172 -1.072969  0.865408 -1.139928
13 -2.301539  1.744812 -0.761207  0.319039 -0.249370  0.983605
14  1.462108 -2.060141 -0.322417 -0.384054  1.133769 -2.382558

In [71]:
df

           X         Y         Z         W         P       New
12  1.624345 -0.611756 -0.528172 -1.072969  0.865408 -1.139928
13 -2.301539  1.744812 -0.761207  0.319039 -0.249370  0.983605
14  1.462108 -2.060141 -0.322417 -0.384054  1.133769 -2.382558
15 -1.099891 -0.172428 -0.877858  0.042214  0.582815 -1.050287

In [72]:
#Conditional Filtering Operation

In [74]:
print('\nboolean dataframe(s) where we are checking  if the value is  greater than 0\n','*'*75,sep='')
(df>0)

boolean dataframe(s) where we are checking  if the value is  greater than 0
***************************************************************************

        X      Y      Z      W      P    New
12   True  False  False  False   True  False
13  False   True  False   True  False   True
14   True  False  False  False   True  False
15  False  False  False   True   True  False

In [78]:
df[df.loc[[12,13,14]]>0]

           X         Y   Z         W         P       New
12  1.624345       NaN NaN       NaN  0.865408       NaN
13       NaN  1.744812 NaN  0.319039       NaN  0.983605
14  1.462108       NaN NaN       NaN  1.133769       NaN
15       NaN       NaN NaN       NaN       NaN       NaN

In [86]:
matrixdata=np.matrix('22,66,140;42,70,148;30,62,125;35,68,160;25,62,152')
rows=['A','B','C','D','E']
columns=['Age','Height','Weight']
matrixdata

matrix([[ 22,  66, 140],
        [ 42,  70, 148],
        [ 30,  62, 125],
        [ 35,  68, 160],
        [ 25,  62, 152]])

In [91]:
df=pd.DataFrame(matrixdata,rows,columns)

In [94]:
df[df['Height']>65]

   Age  Height  Weight
A   22      66     140
B   42      70     148
D   35      68     160

In [101]:
df[(df['Height']>65) & (df['Age']>30) & (df['Weight']>125) ]

   Age  Height  Weight
B   42      70     148
D   35      68     160

In [102]:
df

   Age  Height  Weight
A   22      66     140
B   42      70     148
C   30      62     125
D   35      68     160
E   25      62     152

In [103]:
'Student,Engineer,teacher,nurse,Doctor'.split(',')

['Student,Engineer,teacher,nurse,Doctor']

In [105]:
df['xyz']='Student,Engineer,teacher,nurse,Doctor'.split(',')

In [109]:
df.reset_index(drop=True)

   Age  Height  Weight       xyz
0   22      66     140   Student
1   42      70     148  Engineer
2   30      62     125   teacher
3   35      68     160     nurse
4   25      62     152    Doctor

In [110]:
df.set_index('xyz')

          Age  Height  Weight
xyz
Student    22      66     140
Engineer   42      70     148
teacher    30      62     125
nurse      35      68     160
Doctor     25      62     152

In [ ]:
#Multiindexing
#indexlevel

In [112]:
outside=['G1','G1','G1','G2','G2','G2']
inside=[1,2,3,1,2,3]
hierindex=list(zip(outside,inside))

In [113]:
hierindex

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [118]:
hiere=pd.MultiIndex.from_tuples(hierindex)
print('\nindex hierarchy\n','*'*75,sep='')
hiere

index hierarchy
***************************************************************************

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [124]:
s=pd.DataFrame(data=np.round(rn(6,4)),index=hiere,columns=['A','B','C','D'])
s

        A    B    C    D
G1 1  0.0 -1.0  0.0  1.0
   2 -1.0  0.0 -1.0 -0.0
   3 -2.0  1.0  0.0 -0.0
G2 1 -1.0  1.0  2.0 -2.0
   2  1.0  2.0  0.0 -1.0
   3  1.0 -0.0 -1.0 -1.0

In [127]:
l1=['A','A','A','B','B','B','C','C','C']
l2=[1,2,3,1,2,3,1,2,3]
l3=[1,2,3,4,5,6,7,8,9]
hier=list(zip(l1,l2,l3))
hier

[('A', 1, 1),
 ('A', 2, 2),
 ('A', 3, 3),
 ('B', 1, 4),
 ('B', 2, 5),
 ('B', 3, 6),
 ('C', 1, 7),
 ('C', 2, 8),
 ('C', 3, 9)]

In [129]:
hier=pd.MultiIndex.from_tuples(hier)
print('\nindex hierarchy\n','*'*75,sep='')
hier

index hierarchy
***************************************************************************

MultiIndex([('A', 1, 1),
            ('A', 2, 2),
            ('A', 3, 3),
            ('B', 1, 4),
            ('B', 2, 5),
            ('B', 3, 6),
            ('C', 1, 7),
            ('C', 2, 8),
            ('C', 3, 9)],
           )

In [131]:
s=pd.DataFrame(data=np.round(rn(9,4)),index=hier,columns=['A','B','C','D'])
s

         A    B    C    D
A 1 1 -2.0 -1.0  1.0  3.0
  2 2 -0.0  0.0 -0.0  1.0
  3 3 -0.0  1.0 -0.0 -1.0
B 1 4  0.0  1.0  1.0 -0.0
  2 5 -1.0  1.0  0.0  0.0
  3 6 -0.0  1.0  0.0  2.0
C 1 7  1.0  1.0 -2.0  1.0
  2 8  0.0  1.0  1.0 -0.0
  3 9  1.0 -1.0  2.0 -1.0